In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/population_cleaned.csv")

In [11]:
df.head()
one_hundred_cities = pd.DataFrame(df)
one_hundred_cities = one_hundred_cities.head(100)
one_hundred_cities

,"City, State",2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,"New York City , New York","8,175,133","8,272,948","8,346,693","8,396,091","8,433,806","8,463,049","8,469,153","8,437,478","8,390,081","8,336,817"
1,"Los Angeles , California","3,792,621","3,820,876","3,851,202","3,881,622","3,909,901","3,938,568","3,963,226","3,975,788","3,977,596","3,979,576"
2,"Chicago , Illinois","2,695,598","2,708,114","2,719,141","2,725,731","2,727,066","2,724,344","2,716,723","2,711,069","2,701,423","2,693,976"
3,"Houston , Texas","2,099,451","2,126,032","2,161,593","2,199,391","2,241,826","2,286,908","2,309,544","2,316,750","2,318,573","2,320,268"
4,"Phoenix , Arizona","1,445,632","1,469,796","1,499,274","1,526,491","1,555,445","1,583,690","1,612,199","1,633,560","1,654,675","1,680,992"
...,...,...,...,...,...,...,...,...,...,...,...
95,"Hialeah , Florida","224,669","228,127","230,445","232,316","232,850","233,872","234,283","236,314","234,941","233,339"
96,"Richmond , Virginia","204,214","206,391","210,794","213,860","217,044","220,856","225,369","227,230","229,221","230,436"
97,"Boise , Idaho","205,671","212,635","215,627","217,330","219,440","220,850","224,604","227,648","228,442","228,959"
98,"Spokane , Washington","208,916","209,042","209,304","210,036","211,095","212,545","215,191","217,415","219,332","222,081"
99,"Baton Rouge , Louisiana","229,493","228,643","228,889","228,346","227,851","227,202","226,686","224,414","222,190","220,236"

In [21]:
city_state = one_hundred_cities["City, State"].str.split(" , ", n = 1, expand = True)
city_state

                0           1
0   New York City    New York
1     Los Angeles  California
2         Chicago    Illinois
3         Houston       Texas
4         Phoenix     Arizona
..            ...         ...
95        Hialeah     Florida
96       Richmond    Virginia
97         Boise        Idaho
98        Spokane  Washington
99    Baton Rouge   Louisiana

[100 rows x 2 columns]

In [22]:
one_hundred_cities["City"] = city_state[0]
one_hundred_cities["State_Name"] = city_state[1]
one_hundred_cities

,"City, State",2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,City,State_Name
0,"New York City , New York","8,175,133","8,272,948","8,346,693","8,396,091","8,433,806","8,463,049","8,469,153","8,437,478","8,390,081","8,336,817",New York City,New York
1,"Los Angeles , California","3,792,621","3,820,876","3,851,202","3,881,622","3,909,901","3,938,568","3,963,226","3,975,788","3,977,596","3,979,576",Los Angeles,California
2,"Chicago , Illinois","2,695,598","2,708,114","2,719,141","2,725,731","2,727,066","2,724,344","2,716,723","2,711,069","2,701,423","2,693,976",Chicago,Illinois
3,"Houston , Texas","2,099,451","2,126,032","2,161,593","2,199,391","2,241,826","2,286,908","2,309,544","2,316,750","2,318,573","2,320,268",Houston,Texas
4,"Phoenix , Arizona","1,445,632","1,469,796","1,499,274","1,526,491","1,555,445","1,583,690","1,612,199","1,633,560","1,654,675","1,680,992",Phoenix,Arizona
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,"Hialeah , Florida","224,669","228,127","230,445","232,316","232,850","233,872","234,283","236,314","234,941","233,339",Hialeah,Florida
96,"Richmond , Virginia","204,214","206,391","210,794","213,860","217,044","220,856","225,369","227,230","229,221","230,436",Richmond,Virginia
97,"Boise , Idaho","205,671","212,635","215,627","217,330","219,440","220,850","224,604","227,648","228,442","228,959",Boise,Idaho
98,"Spokane , Washington","208,916","209,042","209,304","210,036","211,095","212,545","215,191","217,415","219,332","222,081",Spokane,Washington
99,"Baton Rouge , Louisiana","229,493","228,643","228,889","228,346","227,851","227,202","226,686","224,414","222,190","220,236",Baton Rouge,Louisiana

In [20]:
gb_one_hundred_cities = one_hundred_cities.groupby(["State_Name"])
gb_one_hundred_cities = pd.DataFrame()

In [14]:
df1 = pd.read_csv("../data/StateNameAndID.csv")
df1.head()

   State_Name State_ID
0     Alabama       AL
1      Alaska       AK
2     Arizona       AZ
3    Arkansas       AR
4  California       CA

In [16]:
one_hundred_cities.dtypes

City, State    object
2010           object
2011           object
2012           object
2013           object
2014           object
2015           object
2016           object
2017           object
2018           object
2019           object
City           object
State_Name     object
dtype: object

In [17]:
df1.dtypes

State_Name    object
State_ID      object
dtype: object

In [24]:
# Merge two dataframes using an inner join
merge_df = pd.merge(one_hundred_cities, df1, how="left", on="State_Name")
merge_df

,"City, State",2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,City,State_Name,State_ID
0,"New York City , New York","8,175,133","8,272,948","8,346,693","8,396,091","8,433,806","8,463,049","8,469,153","8,437,478","8,390,081","8,336,817",New York City,New York,NY
1,"Los Angeles , California","3,792,621","3,820,876","3,851,202","3,881,622","3,909,901","3,938,568","3,963,226","3,975,788","3,977,596","3,979,576",Los Angeles,California,CA
2,"Chicago , Illinois","2,695,598","2,708,114","2,719,141","2,725,731","2,727,066","2,724,344","2,716,723","2,711,069","2,701,423","2,693,976",Chicago,Illinois,IL
3,"Houston , Texas","2,099,451","2,126,032","2,161,593","2,199,391","2,241,826","2,286,908","2,309,544","2,316,750","2,318,573","2,320,268",Houston,Texas,TX
4,"Phoenix , Arizona","1,445,632","1,469,796","1,499,274","1,526,491","1,555,445","1,583,690","1,612,199","1,633,560","1,654,675","1,680,992",Phoenix,Arizona,AZ
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,"Hialeah , Florida","224,669","228,127","230,445","232,316","232,850","233,872","234,283","236,314","234,941","233,339",Hialeah,Florida,FL
96,"Richmond , Virginia","204,214","206,391","210,794","213,860","217,044","220,856","225,369","227,230","229,221","230,436",Richmond,Virginia,VA
97,"Boise , Idaho","205,671","212,635","215,627","217,330","219,440","220,850","224,604","227,648","228,442","228,959",Boise,Idaho,ID
98,"Spokane , Washington","208,916","209,042","209,304","210,036","211,095","212,545","215,191","217,415","219,332","222,081",Spokane,Washington,WA
99,"Baton Rouge , Louisiana","229,493","228,643","228,889","228,346","227,851","227,202","226,686","224,414","222,190","220,236",Baton Rouge,Louisiana,LA

In [10]:
df.describe()

,"City, State",2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,City,State
count,788,788,788,788,788,788,788,788,788,788,788,100,100
unique,788,776,785,783,785,783,786,787,784,785,785,100,34
top,"Santa Clara , California",(X),"56,000","67,844","53,149","52,463","60,908","60,304","84,809","53,557","59,439",Chandler,California
freq,1,8,2,2,2,2,2,2,2,2,2,1,16

In [ ]:
df = pd.read_csv("../data/population_cleaned.csv")

In [12]:
# Exploratory Analysis
df.dtypes
# aggregate by state
# examine the columns and make sure you know what they are
# understand what the dependent and independent variables are

county                           object
state                            object
percentage16_Donald_Trump       float64
percentage16_Hillary_Clinton    float64
total_votes16                   float64
votes16_Donald_Trump            float64
votes16_Hillary_Clinton         float64
percentage20_Donald_Trump       float64
percentage20_Joe_Biden          float64
total_votes20                   float64
votes20_Donald_Trump            float64
votes20_Joe_Biden               float64
lat                             float64
long                            float64
cases                           float64
deaths                          float64
TotalPop                        float64
Men                             float64
Women                           float64
Hispanic                        float64
White                           float64
Black                           float64
Native                          float64
Asian                           float64
Pacific                         float64
VotingAgeCitizen                float64
Income                          float64
IncomeErr                       float64
IncomePerCap                    float64
IncomePerCapErr                 float64
Poverty                         float64
ChildPoverty                    float64
Professional                    float64
Service                         float64
Office                          float64
Construction                    float64
Production                      float64
Drive                           float64
Carpool                         float64
Transit                         float64
Walk                            float64
OtherTransp                     float64
WorkAtHome                      float64
MeanCommute                     float64
Employed                        float64
PrivateWork                     float64
PublicWork                      float64
SelfEmployed                    float64
FamilyWork                      float64
UnemploymentCategorical          object
dtype: object

In [21]:
Independent_Variables = df[["percentage16_Donald_Trump", "percentage20_Donald_Trump", "percentage16_Hillary_Clinton", "percentage20_Joe_Biden"]]

,percentage16_Donald_Trump,percentage20_Donald_Trump,percentage16_Hillary_Clinton,percentage20_Joe_Biden
0,0.629,0.661,0.346,0.330
1,0.773,0.795,0.206,0.191
2,0.545,0.542,0.428,0.447
3,0.479,0.504,0.387,0.465
4,0.653,0.697,0.300,0.286
...,...,...,...,...
3106,0.505,0.523,0.450,0.461
3107,0.805,0.826,0.150,0.156
3108,0.328,0.525,0.656,0.471
3109,0.204,0.340,0.777,0.654
3110,0.480,0.446,0.460,0.531

In [ ]:
# Data Cleaning
# What do we do with nulls?
    # in dependent variables?
    # in independent variables?
# fill in data from different sources
# fil in data based on other data
# understand the limitations
# Understand the data that is missing before you drop it
# hope that missing data is randomly distributed (explore it, hystograms). Ensure that dropping data does not affect the analysis
# outliers
# dates
# decimals vs integers - put them all on the same format for analysis (easier to compare)
# check categorical - something like value_count
# change the dependent variables to something that can be more useful
# make sure dependent variables are expressed correctly

In [ ]:
# more exploratory data analysis (on clean data)
# graphing:
    # scatter plot
    # histogram - distribution of data 
# comparing independent variables with our dependent variables (women vs Trump)
# compare indenpendet variables with indepentent variables (women vs men)
# correlation matrix using pearson correlation

# Assumptions:
# - our data is independent (mostly, ofr the stat tests we've looked at)
# - our data is normally distributed

In [ ]:
# 7. Analyze for Trends
# at this point, we have:
    # clean data
    # a sense of what dat is correlated accross independent variables
    # a sense of what independent data is correlated with dependent
# What do we actually do in this step?
# 1. Decide which variables are important
# 2. Statistical testing
    # ensure that our data roughtly matches the assumptions of the stat tests
    # apply the correct stat tests